import os

# ======================================================================================================================
# === БАЗА ДАННЫХ ======================================================================================================
# ======================================================================================================================
DATABASE_NAME = "all_albums"
PATH_TO_DB = f"{os.path.join(os.getcwd(), DATABASE_NAME)}.db"
TABLE_NAME = DATABASE_NAME
TABLE_COLUMNS = {
    "band": "text",
    "album": "text"
}

# ======================================================================================================================
# === РАЗНОЕ ===========================================================================================================
# ======================================================================================================================
CHROME_BINARY_PATH = "GoogleChromePortable/App/Chrome-bin/chrome.exe"
METAL_TRACKER = "https://www.metal-tracker.com"
METAL_TRACKER_SEARCH = METAL_TRACKER + "/torrents/search.html"
WAITING_PERIOD = 120
WELCOME_MESSAGE = "Добро пожаловать в клиент обновлений metal-tracker.ru"
BANDS_TXT = "bands.txt"
RECIPIENT_EMAIL = "teverus@yandex.ru"